Courses/7140/Lectures/Examples/Wiggly-Worms/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-15 Tue 09:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wiggly Worms</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Wiggly Worms</h1>

<div id="outline-container-orgfff49bb" class="outline-2">
<h2 id="orgfff49bb"><span class="section-number-2">1</span> Wiggly Worms in Software Engineering</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>We used to give this Wiggly Worms as a code design project in "CS
101": Develop a wiggly worms game.  Just using the keyboard, and
console text display.</li>

<li>In these lecture notes, a "working" version of an implementation is
given.  GUI is ignored.  We do a simple console UI.</li>

<li>We are assuming that we are "done" with requirements and specs.
But, practice writing them.</li>

<li>We are focused on the (i) use of Assertions, (ii) Design by
Contract (DbC), and (iii) fluency in C++.</li>

<li>Does it have <a href="../../Debugging/">bugs</a>?  Probably.  What does it take to definitively
say that it does or does not have bugs?</li>

<li>Revise the working version so that it is in "proper" OOP form.  As
given, it is definitely improper!  It is all in one file!</li>

<li>How do we explain to a colleague/ classmate, in just one or two
paragraphs, how we discovered and revised the classes?</li>

<li>The implied design + code as-given do not do anything about the
z-axis.  Suggest ideas and implement.</li>

<li>This being an interactive game, how do we test it?</li>
</ol>
</div>
</div>

<div id="outline-container-org1c5a23d" class="outline-2">
<h2 id="org1c5a23d"><span class="section-number-2">2</span> Source Code Details</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>The file <a href="../Wiggly-Worms/worms-one-file.cpp.html">../Wiggly-Worms/worms-one-file.cpp.html</a> implements a grass
roots game example of wiggly worms (scissor heads, cannibals, or
vegetarian kind) moving about.  <code>sloccount cpp 373 (100.00%)</code></li>

<li>The <a href="./worms12-doc.html">./worms12-doc.html</a> file has a few more details on the internals.</li>

<li>There is a little JavaScript that colorizes the worms.cpp into
<a href="../Wiggly-Worms/worms-one-file.cpp.html">../Wiggly-Worms/worms-one-file.cpp.html</a>.  Here is a link to the
plain text source code file: <a href="./worms-one-file.cpp">./worms-one-file.cpp</a> .</li>

<li><a href="./GEN">./GEN</a> contains doxygen-erated listings.</li>
</ol>
</div>

<div id="outline-container-org926f550" class="outline-3">
<h3 id="org926f550"><span class="section-number-3">2.1</span> Linux</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>If you work on Linux, you will need to install <code>ncurses</code> related
development files.
<a href="https://www.cyberciti.biz/faq/linux-install-ncurses-library-headers-on-debian-ubuntu-centos-fedora/">https://www.cyberciti.biz/faq/linux-install-ncurses-library-headers-on-debian-ubuntu-centos-fedora/</a>
is a decent tutorial.</li>

<li><code>thor.cs.wright.edu</code> is a large Linux server located in CECS.</li>
<li>Login to thor.cs.wright.edu.  All grad students can obtain an
account. From outside campus, you need VPN.</li>

<li><code>g++ worms-one-file.cpp -o worms -lncurses</code> will compile
and link the program.</li>

<li><p>
<code>% file worms</code> The command named <code>file</code> identifies the content of
the named file.
</p>
<div class="org-src-container">
<pre class="src src-bash">worms: ELF 64-bit LSB executable, x86-64, version 1 (SYSV),
dynamically linked (uses shared libs), for GNU/Linux 2.6.18, not
stripped
</pre>
</div></li>
<li><p>
<code>% ldd worms</code> The command named <code>ldd</code> lists the dynamic libraries
that the named program is linked with.
</p>
<div class="org-src-container">
<pre class="src src-bash">linux-vdso.so.1 =&gt;  (0x00007ffcfe126000)
libncurses.so.5 =&gt; /lib64/libncurses.so.5 (0x000000382c000000)
libstdc++.so.6 =&gt; /usr/local/lib64/libstdc++.so.6 (0x00002acef3b16000)
libm.so.6 =&gt; /lib64/libm.so.6 (0x000000381b200000)
libgcc_s.so.1 =&gt; /usr/local/lib64/libgcc_s.so.1 (0x00002acef3e27000)
libc.so.6 =&gt; /lib64/libc.so.6 (0x000000381ae00000)
libtinfo.so.5 =&gt; /lib64/libtinfo.so.5 (0x0000003829000000)
libdl.so.2 =&gt; /lib64/libdl.so.2 (0x000000381b600000)
ld.so =&gt; /lib64/ld-linux-x86-64.so.2 (0x000055d912f1c000)
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgbfc8837" class="outline-3">
<h3 id="orgbfc8837"><span class="section-number-3">2.2</span> Windows</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>If you wish to work on Windows, use Windows-equivalents of ncurses.
E.g., <a href="https://pdcurses.org/">https://pdcurses.org/</a> or
<a href="https://github.com/peterbrittain/asciimatics">https://github.com/peterbrittain/asciimatics</a> .</li>
<li>There is also a contributed version <a href="./worms-ktsalva-2013.cpp.html">./worms-ktsalva-2013.cpp.html</a>,
by a past student that should be buildable on Windows.  Here is a
link to the plain text source code file: <a href="./worms-ktsalva-2013.cpp">./worms-ktsalva-2013.cpp</a> .</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgeb4130c" class="outline-2">
<h2 id="orgeb4130c"><span class="section-number-2">3</span> Exercises</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Consider our <a href="../Wiggly-Worms/worms-one-file.cpp.html">Wiggly Worms</a> program.  (i) (10 points) Intuitively
describe the "connectedness" of a worm's body from head to the
tail.  (ii) (10 points) State this as an assertion in
mathematical notation using the typedefs originally given (see the
link) or the class definitions you have derived from it.</li>

<li>Consider our <a href="../Wiggly-Worms/worms-one-file.cpp.html">Wiggly Worms</a>.  We wish to describe how a worm crawls.
First, in English prose.  Then, state this as pre- and
post-conditions for the method named <code>void live(WORM * wp)</code></li>

<li>[After Debugging Lectures] Does our Wiggly Worms code have any
bugs? We certainly did not do a spec.  What def of bugs shall we
use?  Should we just use some tools, and copy-paste their output as an
answer to this question?  Note that some tools (eg PMD) show
some questionable coding style, not bugs.</li>
</ol>
</div>
</div>

<div id="outline-container-orgaf2b357" class="outline-2">
<h2 id="orgaf2b357"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Prabhaker Mateti, Lecture Notes on <a href="../../Design/">Design by Contract and SOLID
Principles</a></li>

<li>Prabhaker Mateti, Lecture Notes on <a href="../../Assertions/assertions-cpp.html">Assertions in C++</a></li>
</ol>
</div>
</div>


<div id="outline-container-org51dfd15" class="outline-2">
<h2 id="org51dfd15"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2020-09-11
</div>
</body>
</html>
